#  >  (მეტია)
5 > 3
10 > 7
4 > 9
0 > -1
100 > 200

#  <  (ნაკლებია)
3 < 5
7 < 10
9 < 4
-1 < 0
200 < 100

#  >=  (მეტია ან ტოლია)
5 >= 5
10 >= 7
4 >= 9
0 >= 0
8 >= 2

#  <=  (ნაკლებია ან ტოლია)
3 <= 5
7 <= 10
9 <= 4
0 <= 0
2 <= 8

#  ==  (უდრის თუ არა ერთი მეორეს)
5 == 5
10 == 7
4 == 4
0 == 1
-3 == -3


# არსებობს 2 logical operator-ი, ესენია And და or. 
# 1) And აბრუნებს True-ს მხოლოდ მაშინ თუ ყველა პირობა შესრულებულია
# And აბრუნებს false-ს თუ რომელიმე პირობა არაა შესრულებული
# true  და true   დააბრუნებს true-ს
# true  და false  დააბრუნებს false-ს
# false და true   დააბრუნებს false-ს
# false და false  დააბრუნებს false-ს


# 2) Or ოპერატორი აბრუნებს True-ს თუ ყველა პირობიდან ერთი მაინცაა შესრულებული.
# Or ოპერატორი აბრუნებს False-ს თუ არც ერთი პირობა არაა შესრულებული
# true  და true   დააბრუნებს true-ს
# true  და false  დააბრუნებს true-ს
# false და true   დააბრუნებს true-ს
# false და false  დააბრუნებს false-ს


print((5 > 3) and (10 > 2))
print((7 > 9) and (4 < 6))
print((1 == 1) and (2 == 3))


print((5 > 3) or (10 < 2))
print((7 == 9) or (4 < 6))
print((1 > 5) or (2 > 8))




user_number = int(input("შეიყვანე რიცხვი"))
print(user_number > 10)


my_name = "Nika"
user_name = input("შეიყვანეთ თქვენი სახელი")
print(user_name == my_name)


user_age = int(input("შეიყვანე შენი ასაკი"))
print(user_age > 18)
