# for loop-ს ვიყენებთ მაშინ, როცა გვინდა მივუთითოთ რიცხვების დიაპაზონი ან გვინდა რამდენჯერმე გავიმეოროთ ერთი და იმავე რიცხვი ან სტრინგი.

# while loop-ს ვიყენებთ მაშინ, როცა გვინდა, რომ ციკლი გაგრძელდეს მანამ, სანამ პირობა შესრულდება(ციკლი შეიძლება უსასრულოდ გაგრძელდეს).

# Indentation ნიშნავს გამოტოვებულ ადგილს ხაზის დასაწყისში, იმისთვის, რომ Python მიხვდეს რომელი კოდი რას ეკუთვნის.

# % გვიბრუნებს num1 % num2 ის შედეგად მიღებულ ნაშთს

for i in range(0, 51, 2):
    print(i)

for i in range(10):
    print("ნიკა")

i = 1
while i <= 67:
    if i > 0:
        print(i)
    i += 1

i = 0
while i < 10:
    print("ნიკა")
    i += 1

my_fav = 5

user_input = int(input("შეიყვანე რიცხვი: "))

while user_input < my_fav:
    print("hello world!")
    user_input = int(input("შეიყვანე ახალი რიცხვი: "))

